using System.Collections;
using System.Collections.Generic;
using TMPro;
using UnityEngine;
using System.Linq;

public class LevelManager : MonoBehaviour
{
    [SerializeField] private TMP_Text ScoreText;

    private List<Pickuper> coinsList;
    private LevelProgress progress;

    private void Awake()
    {
        progress = new LevelProgress();
        coinsList = FindObjectsOfType<Pickuper>().ToList();

        foreach (Pickuper coin in coinsList)
        {
            coin.SetLevelManager(this);
        }
    }

    public void UpdateScore(int score)
    { 
        progress.LevelScore += score;
        ScoreText.text = $"Score: { progress.LevelScore }";
    }
    

}

/*

Для A

Если текущ сторна это A, а перс взаимодействовал с нижним тригерром
    То он в F
Если текущ сторна это A, а перс взаимодействовал с левым тригерром
    То он в E
Если текущ сторна это A, а перс взаимодействовал с правым тригерром
    То он в C
Если текущ сторна это A, а перс взаимодействовал с верхним тригерром
    То он в B

Для F

Если текущ сторна это F, а перс взаимодействовал с нижним тригерром
    То он в B
Если текущ сторна это F, а перс взаимодействовал с левым тригерром
    То он в E
Если текущ сторна это F, а перс взаимодействовал с правым тригерром
    То он в C
Если текущ сторна это A, а перс взаимодействовал с верхним тригерром
    То он в A

Для B

Если текущ сторна это B, а перс взаимодействовал с нижним тригерром
    То он в A
Если текущ сторна это B, а перс взаимодействовал с левым тригерром
    То он в E
Если текущ сторна это F, а перс взаимодействовал с правым тригерром
    То он в C
Если текущ сторна это A, а перс взаимодействовал с верхним тригерром
    То он в F

Для E

Если текущ сторна это E а перс взаимодействовал с нижним тригерром
    То он в F
Если текущ сторна это E, а перс взаимодействовал с левым тригерром
    То он в D
Если текущ сторна это E, а перс взаимодействовал с правым тригерром
    То он в A
Если текущ сторна это A, а перс взаимодействовал с верхним тригерром
    То он в B

Для C

Если текущ сторна это C а перс взаимодействовал с нижним тригерром
    То он в F
Если текущ сторна это C, а перс взаимодействовал с левым тригерром
    То он в A
Если текущ сторна это C, а перс взаимодействовал с правым тригерром
    То он в D
Если текущ сторна это A, а перс взаимодействовал с верхним тригерром
    То он в B

Для D

Если текущ сторна это D а перс взаимодействовал с нижним тригерром
    То он в F
Если текущ сторна это D, а перс взаимодействовал с левым тригерром
    То он в C
Если текущ сторна это D, а перс взаимодействовал с правым тригерром
    То он в E
Если текущ сторна это D, а перс взаимодействовал с верхним тригерром
    То он в B

 

Левый триггер - поворот по Y на 90
Правый триггер  - поворот по Y на -90
Верхний триггер - поворот по X на -90
Нижний триггер - поворот по X на 90
 */
